Revit 2027 API
XYZ.Z Property
Gets the third coordinate.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Z { get; }
Public ReadOnly Property Z As Double
	Get
public:
property double Z {
	double get ();
}
member Z : float with get
Property Value
Double
See Also
Reference
XYZ Class
Autodesk.Revit.DB Namespace